# Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:

a = float(input('Введите коэффициент a: '))
b = float(input('Введите коэффициент b: '))
c = float(input('Введите коэффициент c: '))

d = b ** 2 + 4* a * c
if d < 0:
    print('Квадратное уравнение не имеет корней')
elif d == 0:
    x1 = (-b) / (2 * a)
    print(f'Квадратное уравнение имеет один корень x = {round(x1, 2)}')
else:
    x1 = (-b + d ** 0.5) / (2 * a)
    x2 = (-b - d ** 0.5) / (2 * a)
    print(f'Квадратное уравнение имеет два корня: x1 = {round(x1, 2)} и x2 = {round(x2, 2)}')




# import math
# a = float(input('Введите коэффициент a: '))
# b = float(input('Введите коэффициент b: '))
# c = float(input('Введите коэффициент c: '))

# d = b ** 2 + 4* a * c

# if d > 0:
#     x1 = (-b + math.sqrt(d)) / (2 * a)
#     x2 = (-b - math.sqrt(d)) / (2 * a)
#     print("x1 = %.2f \nx2 = %.2f" % (x1, x2))
# elif d == 0:
#     x = -b / (2 * a)
#     print("x = %.2f" % x)
# else:
#     print("Корней нет")
