# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

l = [int(x) for x in input('Введите числа в список через запятую: ').split(',')]

l1 = []
for i in range((len(l)+ 1) // 2):
    l1.append(l[i] * l[-1 - i])

print(f'{l} => {l1}')